# vim: ft=ruby

tap "cjbassi/gotop"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "universal-ctags/universal-ctags"
tap "xwmx/taps"
brew "gcc"
brew "zk"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]

brew "neovim", args: ["HEAD"], greedy: true
# Deps for building neovim
brew "ninja"
brew "libtool"
brew "automake"
brew "cmake"
brew "pkg-config"
brew "gettext"

brew "universal-ctags"

cask "alacritty"
brew "terminal-notifier"
brew "starship"
brew "direnv"

# Fuzzy finders
brew "ack"
brew "fd"
brew "fzf"
brew "ripgrep"
# task
brew "task"
brew "taskd"
brew "tasksh"

# git stuff
brew "gh"
brew "pre-commit"
brew "gnupg"
brew "git-secret"

# Tmux
brew "tmux"
# TODO: do I need this?
brew "tmuxinator"

# Utils
# GNU Utils
brew "coreutils"
# format json on termina
brew "jq"
# Check running processes
brew "htop"
brew "gotop"
# path tree view
brew "tree"
# Symlink for dotfiles
brew "stow"
# Parse image formats
brew "imagemagick"
brew "pandoc"
# GNU awk
brew "gawk"
brew "nnn"

brew "pipx"
brew "node"
brew "just"

# Network
brew "wget"
brew "nmap"
brew "httpie"
