tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
cask "adoptopenjdk"
# Search tool like grep, but optimized for programmers
brew "ack"
# The Clojure Programming Language
brew "clojure"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Command-line tool to interact with exercism.io
brew "exercism"
# Extensions to follow Vincent Driessen's branching model
brew "git-flow"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Colorize logfiles and command output
brew "grc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Ruby version manager
brew "rbenv"
# Sparklines for the shell
brew "spark"
# Programatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Tracks most-used directories to make cd smarter
brew "z"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
cask "font-hack-nerd-font"
